using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;
using ViKing.Engine;
using static AccManager.Logg;

namespace AccManager
{
    static class NickShaker
    {
        private static string[] Samples_RU = {
        "ад", "аж", "аз", "аи", "ай", "ан", "ар", "ас", "ау", "ах", "ба", "бы", "во", "вы", "га", "гм", "да", "до", "ее", "еж", "ер", "же", "за", "из", "ил", "ин",
            "их", "ка", "ко", "кш", "ли", "ль", "ля", "ми", "мм", "мо", "му", "мы", "на", "не", "ни", "но", "ну", "ню", "об", "ой", "ом", "он", "оп", "от", "ох", "па",
            "по", "ре", "се", "си", "со", "су", "то", "ты", "уа", "уд", "уж", "ук", "ум", "ус", "уф", "ух", "фа", "фи", "фу", "ха", "хм", "це", "че", "чу", "ша", "ща",
            "щи", "эй", "эк", "эм", "эн", "эр", "эс", "эф", "эх", "юг", "юз", "юр", "юс", "ют", "яд", "яз", "як", "ял", "ям", "яр", "яс", "аба", "абы", "ага", "агу", "азу",
            "азы", "аил", "аир", "акр", "акт", "али", "аль", "ант", "ара", "асс", "ату", "аул", "аут", "ахи", "баз", "бай", "бак", "бал", "бар", "бас", "бах", "бац", "баш",
            "бег", "беж", "без", "бей", "бек", "бел", "бес", "бис", "бит", "бич", "боа", "боб", "бог", "бой", "бок", "бом", "бон", "бор", "бот", "бош", "бра", "бри", "брр",
            "буж", "буй", "бук", "бум", "бур", "бут", "бух", "бык", "быт", "бэр", "важ", "вал", "вар", "ваш", "век", "вес", "виг", "вид", "вир", "вис", "вне", "вод", "воз",
            "вой", "вол", "вон", "вор", "вот", "все", "вуз", "вша", "выя", "вяз", "гад", "газ", "гай", "гак", "гам", "где", "гей", "ген", "гид", "гик", "гит", "гну", "год",
            "дот", "дуб", "дух", "душ", "дым", "его", "еда", "ежа", "еле", "ель", "ера", "ерш", "еры", "ерь", "еще", "жар", "жид", "жим", "жир", "жок", "жом", "жор", "жох",
            "жук", "зав", "зад", "зал", "зам", "зги", "зев", "зет", "зиг", "зло", "зоб", "зов", "зря", "зуб", "зуд", "зуй", "зык", "ибо", "ива", "иго", "идо", "иды", "иже",
            "изо", "икс", "или", "иль", "имя", "инк", "иол", "ион", "иск", "ишь", "йог", "йод", "йот", "как", "кал", "кап", "кат", "кеб", "кед", "кий", "кик", "кил", "кит",
            "код", "кой", "кок", "кол", "ком", "кон", "кот", "кош", "кто", "куб", "кум", "кун", "кур", "кус", "кут", "куш", "лаг", "лад", "лаж", "лаз", "лай", "лак", "лал",
            "лан", "лар", "лев", "лед", "леи", "лей", "лек", "лен", "лес", "лет", "лещ", "лея", "лик", "лис", "лиф", "лоб", "лов", "лог", "лом", "лот", "лох", "луб", "луг",
            "лук", "луч", "лье", "люб", "люд", "люк", "ляд", "лях", "маг", "маз", "май", "мак", "мат", "мах", "мга", "мед", "меж", "мел", "мех", "меч", "миг", "мим", "мир",
            "миф", "мой", "мол", "мор", "мот", "мох", "муж", "мул", "мыс", "мыт", "мэр", "мяу", "мяч", "над", "нар", "наш", "нет", "неф", "низ", "ниц", "нож", "нок", "ном",
            "нос", "нут", "нэп", "нюх", "оба", "обо", "ого", "ода", "одр", "око", "она", "они", "оно", "опт", "орс", "орт", "оса", "ост", "ось", "ото", "охи", "очи", "паж",
            "паз", "пай", "пак", "пал", "пан", "пар", "пас", "пат", "паф", "пах", "пек", "пес", "пик", "пим", "пир", "пли", "под", "пол", "поп", "пот", "при", "про", "пря",
            "пуд", "пук", "пул", "пуп", "пуф", "пух", "пыж", "пыл", "пых", "пэр", "раб", "рад", "раж", "раз", "рай", "рак", "рев", "рез", "рей", "рея", "ржа", "рис", "риф",
            "ров", "рог", "род", "рой", "рок", "рол", "ром", "рот", "рцы", "рык", "рым", "рюш", "ряд", "ряж", "сад", "саж", "саз", "сак", "сам", "сан", "сап", "сев", "сей",
            "сем", "сет", "сиг", "сие", "сип", "сок", "сом", "сон", "сор", "сот", "соя", "сто", "суд", "суп", "сын", "сыр", "сыч", "сэр", "сяк", "сям", "таз", "таи",
            "так", "тал", "там", "тат", "тем", "тес", "тик", "тип", "тир", "тис", "тиф", "тля", "той", "ток", "тол", "том", "тон", "топ", "тор", "тот", "три", "тсс", "туз",
            "тук", "тун", "тур", "тут", "туф", "туш", "туя", "тык", "тыл", "тын", "тюк", "тяж", "тяп", "увы", "угу", "уда", "удэ", "уже", "ужо", "уза", "узы", "унт", "ура",
            "усы", "уха", "ухо", "уши", "уют", "фаг", "фай", "фал", "фас", "фат", "фен", "фес", "фея", "фок", "фол", "фон", "фот", "фри", "фру", "фря", "фуй", "фук", "фут",
            "хаз", "хай", "хам", "хан", "хап", "хек", "хер", "хна", "хны", "ход", "хон", "хоп", "хор", "хук", "цап", "цеж", "цеп", "цех", "цок", "цоп", "цуг", "цук", "цыц",
            "шар", "шах", "шед", "шеф", "шея", "шик", "шип", "шиш", "шов", "шок", "шум", "шут", "щец", "щип", "щит", "щуп", "щур", "эва", "эге", "эка", "экю", "эль", "эму",
            "эра", "эрг", "эре", "эрл", "эст", "это", "эфа", "эхо", "юит", "юла", "юра", "юрк", "юрт", "явь", "яга", "язь", "яко", "яма", "ямб", "ярд", "ярл", "ярь", "ять",
            "нава", "нага", "нага", "нажа", "наива", "нака", "нака", "нама", "нана", "напа", "наса", "ната", "нафа", "наца", "нача", "нева", "нега", "неда", "неза", "нема",
            "нерва", "неча", "нива", "нига", "ника", "нила", "нина", "ниса", "нифа", "ниша", "нога", "нода", "нода", "ноева", "нока", "нома", "нона", "нона", "нора", "носа",
            "нота", "ноха", "ноча", "ноша", "нрава", "нуга", "нуда", "нужа", "нуна", "нура", "нуха", "нуца", "нуша", "ныма", "нына", "ныша", "нюба", "нюда", "нюма", "нюра",
            "няра", "няша", "обава","ибла", "ибра", "ивана", "ивина", "ивка", "ивова", "игана", "игина", "игла", "игра", "игра", "иена", "ижана", "ижева", "изава", "изба",
            "изра", "иида", "икра", "икра", "икша", "илена", "илиа", "илина", "илла", "илфа", "имана", "имка", "имма", "инга", "инда", "инжа", "инива", "инка", "инка", "инна",
            "инта", "инфа", "иода", "иона", "иота", "иота", "ирава", "ирана", "ирга", "иржа", "ирива", "ирка", "ирма", "ирона", "исава", "исана", "исина", "иска", "исона", "исона",
            "исса", "исса", "иста", "итана", "иуана", "иуда", "иуда", "ицка", "ицына", "ичёва", "ичка", "ишана", "ишана","обава", "обжа", "обла", "овена", "овина", "овина", "овка",
            "овта", "овца", "огона", "одина", "ожга", "ожма", "озда", "озона", "оита", "окна", "окра", "окра", "окса", "окса", "олина", "олина", "олма", "омана", "омена", "омша",
            "онда", "онза", "опана", "опена", "орда", "орда", "орова", "оруна", "орша", "осина", "оска", "осма", "оспа", "оспа", "отра", "офра", "охана", "охра", "оцава", "очина",
            "очка", "ошва", "ошева", "ошла", "ошма", "ошта", "ояма","а", "абба", "абина", "абува", "абуна", "абча", "авжа", "авиа", "агава", "агана", "агина", "агма", "агона",
            "агра", "агса", "адава", "адена", "адина", "адова", "адта", "адша", "ажана", "азана", "азана", "азина", "азина", "азма", "азова", "азра", "аида", "аира", "аира",
            "аита", "аиша", "айба", "айва", "айда", "айда", "айза", "айина", "айка", "айма", "айна", "айса", "айта", "айша", "акана", "акена", "акка", "акка", "акуа","юбка",
            "югжа", "югова", "югэна", "юдина", "юдова", "южва", "южина", "юзга", "юкина", "юкка", "юлена", "юлина", "юлка", "юмава", "юмина", "юмка", "юнга", "юнева", "юнёва",
            "юнка", "юпина", "юрга", "юрина", "юрина", "юрка", "юрма", "юрна", "юрова", "юрта", "юсева", "юсова", "ютина", "юфка", "юфта", "юхина", "юхма", "юхова", "юхта", "юхта",
            "ючка", "юшина", "юшка", "ющева", "ющова", "ююба", "ябга", "ябина", "явка", "ягюва", "яджа", "ядова", "яжга", "язана", "язва", "язва", "язева", "язова", "язса", "яита",
            "яйла", "якова", "якуа", "якша", "ялма", "ялова", "ялса", "ялта", "ямана", "ямба", "ямжа", "ямина", "ямка", "ямна", "янва", "янга", "янда", "янина", "янова", "янса", "япона",
            "ярга", "ярка", "ярка", "ярна", "ярова", "ясена", "ясина", "яска", "ятва", "ятка", "ятма", "яуза","обама", "обгона", "обдува", "обена", "оберна", "обжина", "обида", "облова",
            "обмана", "обмена", "обмена", "обмина", "обмыва", "обора", "обрыва", "обрыва", "обсева", "обуза", "овата", "овдина", "овсова", "овтына", "овцына", "огдена", "огема", "огива",
            "оглана", "огнева", "огнёва", "одеона", "одина", "ойтина", "окава", "окала", "окана", "океана", "океана", "октана", "олана", "олдена", "олеина", "олива", "олифа", "олица",
            "олуша", "ольга", "ольха", "ольха", "ольша", "омала", "омана", "омаха", "омаха", "омега", "омела", "омура", "омута", "онега", "онсэна", "онуча", "опала", "опала",

            };


        private static Random rnd = new Random();

        static public string GetRandomNick_RU(string server, uint minLen = 7, uint maxLen = 11)
        {
            string res = "";
            try
            {
                if (string.IsNullOrEmpty(server))
                {
                    Log("сервер пуст");
                    return "";
                }

                string link = $@"https://worldofwarcraft.com/ru-ru/game/status";
                var doc = VkRequest.Request(link).GetHtmlDocument();

                if (!doc.Text.Contains(server))
                {
                    Log("Сервер не найден, введите правильное название.");
                    return res;
                }

                while (res.Length < minLen)
                {
                    res += Samples_RU[rnd.Next(Samples_RU.Length)];
                }

                if (res.Length > maxLen || !lastCharINormal(res))
                {
                    res = GetRandomNick_RU(server, minLen, maxLen);
                }
                else
                {
                    res = res.Substring(0, 1).ToUpper() + res.Substring(1, res.Length - 1);
                }

                if (!check_Nick_free_RU(res, server))
                {
                    return "";
                    //res = GetRandomNick_RU(server, minLen, maxLen);
                }
            }
            catch (Exception ex)
            {
                MessageBox.Show(ex.Message);
                //throw;
            }
            return res;
        }

        private static bool lastCharINormal(string word)
        {
            if (word[word.Length - 1] == 'ъ')
            {
                return false;
            }

            if (word[word.Length - 1] == 'ь')
            {
                return false;
            }

            if (word[word.Length - 1] == 'щ')
            {
                return false;
            }

            return true;
        }

        private static bool check_Nick_free_RU(string nick, string server)
        {
            server = server.Trim().Replace(' ', '-').Replace('й','и');
            nick = nick.Trim();
            var URL_nick = HttpUtility.UrlEncode(nick);
            var URL_server = HttpUtility.UrlEncode(server);
            string link = $@"http://eu.battle.net/wow/ru/character/{URL_server}/{URL_nick}/simple";
            var doc = VkRequest.Request(link).GetHtmlDocument();

            if (doc.Text.Contains("Профиль этого персонажа невозможно отобразить"))
            {
                Log(nick + " свободен!");
                return true;
            }
            else if (string.IsNullOrEmpty(doc.Text))
            {
                Log("Нет доступа к сайту? или еще что-то");
                return false;
            }
            else
            {
                Log(nick + " занят.");
                return false;
            }
        }
    }
}
